Import the data

In [122]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings('ignore')

In [123]:
df=pd.read_csv('datasets/airlines_reviews.csv')

In [124]:
df.head()

,Unnamed: 0,Airline Name,Overall_Rating,Review_Title,Review Date,Verified,Review,Aircraft,Type Of Traveller,Seat Type,Route,Date Flown,Seat Comfort,Cabin Staff Service,Food & Beverages,Ground Service,Inflight Entertainment,Wifi & Connectivity,Value For Money,Recommended
0,0,AB Aviation,9,"""pretty decent airline""",11th November 2019,True,Moroni to Moheli. Turned out to be a pretty ...,NaN,Solo Leisure,Economy Class,Moroni to Moheli,November 2019,4.0,5.0,4.0,4.0,NaN,NaN,3.0,yes
1,1,AB Aviation,1,"""Not a good airline""",25th June 2019,True,Moroni to Anjouan. It is a very small airline...,E120,Solo Leisure,Economy Class,Moroni to Anjouan,June 2019,2.0,2.0,1.0,1.0,NaN,NaN,2.0,no
2,2,AB Aviation,1,"""flight was fortunately short""",25th June 2019,True,Anjouan to Dzaoudzi. A very small airline an...,Embraer E120,Solo Leisure,Economy Class,Anjouan to Dzaoudzi,June 2019,2.0,1.0,1.0,1.0,NaN,NaN,2.0,no
3,3,Adria Airways,1,"""I will never fly again with Adria""",28th September 2019,False,Please do a favor yourself and do not fly wi...,NaN,Solo Leisure,Economy Class,Frankfurt to Pristina,September 2019,1.0,1.0,NaN,1.0,NaN,NaN,1.0,no
4,4,Adria Airways,1,"""it ruined our last days of holidays""",24th September 2019,True,Do not book a flight with this airline! My fr...,NaN,Couple Leisure,Economy Class,Sofia to Amsterdam via Ljubljana,September 2019,1.0,1.0,1.0,1.0,1.0,1.0,1.0,no

In [125]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23171 entries, 0 to 23170
Data columns (total 20 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Unnamed: 0              23171 non-null  int64
 1   Airline Name            23171 non-null  object
 2   Overall_Rating          23171 non-null  object
 3   Review_Title            23171 non-null  object
 4   Review Date             23171 non-null  object
 5   Verified                23171 non-null  bool
 6   Review                  23171 non-null  object
 7   Aircraft                7129 non-null   object
 8   Type Of Traveller       19433 non-null  object
 9   Seat Type               22075 non-null  object
 10  Route                   19343 non-null  object
 11  Date Flown              19417 non-null  object
 12  Seat Comfort            19016 non-null  float64
 13  Cabin Staff Service     18911 non-null  float64
 14  Food & Beverages        14500 non-null  float64
 15  Ground Service          18378 non-null  float64
 16  Inflight Entertainment  10829 non-null  float64
 17  Wifi & Connectivity     5920 non-null   float64
 18  Value For Money         22105 non-null  float64
 19  Recommended             23171 non-null  object
dtypes: bool(1), float64(7), int64(1), object(11)
memory usage: 3.4+ MB

EDA

In [126]:
print(df["Review Date"].min())
print(df["Review Date"].max())
#to check if we have enough time frame for the time series

10th April 2005
9th September 2022

In [127]:
#let's stick to the data where we have information on the aircraft ---23k to 7k

In [128]:
df = df.dropna(axis=0, subset=['Aircraft'])

In [129]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7129 entries, 1 to 23169
Data columns (total 20 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Unnamed: 0              7129 non-null   int64
 1   Airline Name            7129 non-null   object
 2   Overall_Rating          7129 non-null   object
 3   Review_Title            7129 non-null   object
 4   Review Date             7129 non-null   object
 5   Verified                7129 non-null   bool
 6   Review                  7129 non-null   object
 7   Aircraft                7129 non-null   object
 8   Type Of Traveller       7129 non-null   object
 9   Seat Type               7129 non-null   object
 10  Route                   7122 non-null   object
 11  Date Flown              7122 non-null   object
 12  Seat Comfort            7029 non-null   float64
 13  Cabin Staff Service     7014 non-null   float64
 14  Food & Beverages        5885 non-null   float64
 15  Ground Service          7073 non-null   float64
 16  Inflight Entertainment  3919 non-null   float64
 17  Wifi & Connectivity     1864 non-null   float64
 18  Value For Money         7129 non-null   float64
 19  Recommended             7129 non-null   object
dtypes: bool(1), float64(7), int64(1), object(11)
memory usage: 1.1+ MB

In [130]:
from functions import nulls

In [131]:
nulls(df)

               column_name  nulls_percentage
0               Unnamed: 0          0.000000
1             Airline Name          0.000000
2           Overall_Rating          0.000000
3             Review_Title          0.000000
4              Review Date          0.000000
5                 Verified          0.000000
6                   Review          0.000000
7                 Aircraft          0.000000
8        Type Of Traveller          0.000000
9                Seat Type          0.000000
10                   Route          0.000982
11              Date Flown          0.000982
12            Seat Comfort          0.014027
13     Cabin Staff Service          0.016131
14        Food & Beverages          0.174499
15          Ground Service          0.007855
16  Inflight Entertainment          0.450274
17     Wifi & Connectivity          0.738533
18         Value For Money          0.000000
19             Recommended          0.000000

In [132]:
from functions import minusculas

In [133]:
minusculas(df)

In [134]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7129 entries, 1 to 23169
Data columns (total 20 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   unnamed: 0              7129 non-null   int64
 1   airline name            7129 non-null   object
 2   overall_rating          7129 non-null   object
 3   review_title            7129 non-null   object
 4   review date             7129 non-null   object
 5   verified                7129 non-null   bool
 6   review                  7129 non-null   object
 7   aircraft                7129 non-null   object
 8   type of traveller       7129 non-null   object
 9   seat type               7129 non-null   object
 10  route                   7122 non-null   object
 11  date flown              7122 non-null   object
 12  seat comfort            7029 non-null   float64
 13  cabin staff service     7014 non-null   float64
 14  food & beverages        5885 non-null   float64
 15  ground service          7073 non-null   float64
 16  inflight entertainment  3919 non-null   float64
 17  wifi & connectivity     1864 non-null   float64
 18  value for money         7129 non-null   float64
 19  recommended             7129 non-null   object
dtypes: bool(1), float64(7), int64(1), object(11)
memory usage: 1.1+ MB

In [135]:
#finish renaming of variables:

In [136]:
df.rename(columns={'overall_rating':'total_rate'}, inplace=True)
df.rename(columns={'airline name':'airline'}, inplace=True)
df.rename(columns={'review date':'review_date'}, inplace=True)
df.rename(columns={'type of traveller':'traveller'}, inplace=True)
df.rename(columns={'seat type':'class_type'}, inplace=True)
df.rename(columns={'date flown':'flight_date'}, inplace=True)
df.rename(columns={'seat comfort':'seat_comfort'}, inplace=True)
df.rename(columns={'cabin staff service':'cabin_staff'}, inplace=True)
df.rename(columns={'food & beverages':'foodrinks'}, inplace=True)
df.rename(columns={'ground service':'ground_staff'}, inplace=True)
df.rename(columns={'inflight entertainment':'entertainment'}, inplace=True)
df.rename(columns={'wifi & connectivity':'connectivity'}, inplace=True)
df.rename(columns={'value for money':'value_for_money'}, inplace=True)

In [137]:
#droping unnamed variable, does not give any additional info

In [138]:
df.drop(columns="unnamed: 0", inplace=True)

In [139]:
#briew revision of all variables

In [140]:
df.columns

Index(['airline', 'total_rate', 'review_title', 'review_date', 'verified',
       'review', 'aircraft', 'traveller', 'class_type', 'route', 'flight_date',
       'seat_comfort', 'cabin_staff', 'foodrinks', 'ground_staff',
       'entertainment', 'connectivity', 'value_for_money', 'recommended'],
      dtype='object')

In [141]:
df.shape #ok

(7129, 19)

In [142]:
df.drop_duplicates(inplace=True)

In [143]:
df.shape #only two duplicates

(7127, 19)

In [144]:
df.airline.value_counts()

airline
Thomson Airways                     81
Hainan Airlines                     78
Garuda Indonesia                    77
Royal Brunei Airlines               74
SilkAir                             68
                                    ..
ASKY Airlines                        1
Thomas Cook Airlines Scandinavia     1
Novoair                              1
Mack Air                             1
Manta Air                            1
Name: count, Length: 438, dtype: int64

In [145]:
df.total_rate.value_counts() #let's check later whether the values correspond to the actual review (e.g. 1 is always good or some people 
#consider it bad?)

total_rate
1    2489
9     968
8     953
7     710
2     604
3     401
6     376
5     325
4     301
Name: count, dtype: int64

In [146]:
df.verified.value_counts()

verified
True     4475
False    2652
Name: count, dtype: int64

In [147]:
df.aircraft.value_counts()

aircraft
A320                         1041
Boeing 737-800                553
Boeing 737                    404
Boeing 787                    349
A330                          349
                             ...
A350-900 / Boeing 777-300       1
A350-900 / Boeing 747-400       1
Boeing 777/350                  1
A350 / B744                     1
Boeing787                       1
Name: count, Length: 1048, dtype: int64

In [148]:
df.traveller.value_counts()

traveller
Solo Leisure      2678
Couple Leisure    1835
Family Leisure    1325
Business          1289
Name: count, dtype: int64

In [149]:
df.seat_comfort.value_counts()

seat_comfort
4.0    1844
5.0    1556
3.0    1432
1.0    1337
2.0     858
Name: count, dtype: int64

In [150]:
df.cabin_staff.value_counts()

cabin_staff
5.0    2657
4.0    1485
1.0    1142
3.0    1025
2.0     703
Name: count, dtype: int64

In [151]:
df.foodrinks.value_counts()

foodrinks
5.0    1376
1.0    1316
4.0    1303
3.0    1123
2.0     765
Name: count, dtype: int64

In [152]:
df.connectivity.value_counts()

connectivity
1.0    959
5.0    304
4.0    223
3.0    219
2.0    158
Name: count, dtype: int64

In [153]:
df.ground_staff.value_counts()

ground_staff
1.0    1874
5.0    1871
4.0    1656
3.0    1018
2.0     652
Name: count, dtype: int64

In [154]:
df.entertainment.value_counts()

entertainment
1.0    1198
3.0     814
4.0     739
5.0     662
2.0     505
Name: count, dtype: int64

In [155]:
df.value_for_money.value_counts()

value_for_money
5.0    2258
1.0    1630
4.0    1456
3.0    1000
2.0     783
Name: count, dtype: int64

In [156]:
df.recommended.value_counts()

recommended
yes    4117
no     3010
Name: count, dtype: int64

In [157]:
df.describe()

,seat_comfort,cabin_staff,foodrinks,ground_staff,entertainment,connectivity,value_for_money
count,7027.000000,7012.000000,5883.000000,7071.00000,3918.000000,1863.000000,7127.000000
mean,3.202647,3.543639,3.111848,3.14114,2.786115,2.331723,3.270661
std,1.410860,1.477818,1.473003,1.55735,1.473514,1.571940,1.556716
min,1.000000,1.000000,1.000000,1.00000,1.000000,1.000000,1.000000
25%,2.000000,2.000000,2.000000,1.00000,1.000000,1.000000,2.000000
50%,3.000000,4.000000,3.000000,3.00000,3.000000,1.000000,4.000000
75%,4.000000,5.000000,4.000000,5.00000,4.000000,4.000000,5.000000
max,5.000000,5.000000,5.000000,5.00000,5.000000,5.000000,5.000000

In [158]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7127 entries, 1 to 23169
Data columns (total 19 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   airline          7127 non-null   object
 1   total_rate       7127 non-null   object
 2   review_title     7127 non-null   object
 3   review_date      7127 non-null   object
 4   verified         7127 non-null   bool
 5   review           7127 non-null   object
 6   aircraft         7127 non-null   object
 7   traveller        7127 non-null   object
 8   class_type       7127 non-null   object
 9   route            7120 non-null   object
 10  flight_date      7120 non-null   object
 11  seat_comfort     7027 non-null   float64
 12  cabin_staff      7012 non-null   float64
 13  foodrinks        5883 non-null   float64
 14  ground_staff     7071 non-null   float64
 15  entertainment    3918 non-null   float64
 16  connectivity     1863 non-null   float64
 17  value_for_money  7127 non-null   float64
 18  recommended      7127 non-null   object
dtypes: bool(1), float64(7), object(11)
memory usage: 1.0+ MB

In [159]:
df.class_type.value_counts()

class_type
Economy Class      5462
Business Class     1266
Premium Economy     286
First Class         113
Name: count, dtype: int64

In [160]:
df.sample()

,airline,total_rate,review_title,review_date,verified,review,aircraft,traveller,class_type,route,flight_date,seat_comfort,cabin_staff,foodrinks,ground_staff,entertainment,connectivity,value_for_money,recommended
14974,Nepal Airlines,2,"""I am waiting past 5 hours""",25th March 2019,True,Worst management by Nepal Airline. I am ver...,A330,Solo Leisure,Economy Class,Kathmandu to New Delhi,March 2019,3.0,3.0,NaN,1.0,NaN,NaN,1.0,no

In [161]:
df.total_rate=pd.to_numeric(df.total_rate)

In [162]:
df.reset_index(inplace=True)

In [163]:
#hasta aqu√≠, ok

Imputing missing values

In [164]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7127 entries, 0 to 7126
Data columns (total 20 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            7127 non-null   int64
 1   airline          7127 non-null   object
 2   total_rate       7127 non-null   int64
 3   review_title     7127 non-null   object
 4   review_date      7127 non-null   object
 5   verified         7127 non-null   bool
 6   review           7127 non-null   object
 7   aircraft         7127 non-null   object
 8   traveller        7127 non-null   object
 9   class_type       7127 non-null   object
 10  route            7120 non-null   object
 11  flight_date      7120 non-null   object
 12  seat_comfort     7027 non-null   float64
 13  cabin_staff      7012 non-null   float64
 14  foodrinks        5883 non-null   float64
 15  ground_staff     7071 non-null   float64
 16  entertainment    3918 non-null   float64
 17  connectivity     1863 non-null   float64
 18  value_for_money  7127 non-null   float64
 19  recommended      7127 non-null   object
dtypes: bool(1), float64(7), int64(2), object(10)
memory usage: 1.0+ MB

In [165]:
df = df.dropna(axis=0, subset=['route']) ##to complicated to impute

In [166]:
df.shape #ok

(7120, 20)

In [167]:
df.seat_comfort.info()

<class 'pandas.core.series.Series'>
Index: 7120 entries, 0 to 7126
Series name: seat_comfort
Non-Null Count  Dtype
--------------  -----
7021 non-null   float64
dtypes: float64(1)
memory usage: 111.2 KB

In [168]:
df['seat_comfort']=df.seat_comfort.fillna(round(np.mean(df.seat_comfort)))

In [169]:
df.seat_comfort.value_counts() #ok

seat_comfort
4.0    1844
5.0    1555
3.0    1530
1.0    1336
2.0     855
Name: count, dtype: int64

In [170]:
df.ground_staff.info()

<class 'pandas.core.series.Series'>
Index: 7120 entries, 0 to 7126
Series name: ground_staff
Non-Null Count  Dtype
--------------  -----
7065 non-null   float64
dtypes: float64(1)
memory usage: 111.2 KB

In [171]:
df['ground_staff']=df.ground_staff.fillna(round(np.mean(df.ground_staff)))

In [172]:
df.ground_staff.value_counts() #ok

ground_staff
1.0    1872
5.0    1870
4.0    1656
3.0    1071
2.0     651
Name: count, dtype: int64

In [173]:
df.cabin_staff.info()

<class 'pandas.core.series.Series'>
Index: 7120 entries, 0 to 7126
Series name: cabin_staff
Non-Null Count  Dtype
--------------  -----
7006 non-null   float64
dtypes: float64(1)
memory usage: 111.2 KB

In [174]:
df['cabin_staff']=df.cabin_staff.fillna(round(np.mean(df.cabin_staff)))

In [175]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7120 entries, 0 to 7126
Data columns (total 20 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            7120 non-null   int64
 1   airline          7120 non-null   object
 2   total_rate       7120 non-null   int64
 3   review_title     7120 non-null   object
 4   review_date      7120 non-null   object
 5   verified         7120 non-null   bool
 6   review           7120 non-null   object
 7   aircraft         7120 non-null   object
 8   traveller        7120 non-null   object
 9   class_type       7120 non-null   object
 10  route            7120 non-null   object
 11  flight_date      7114 non-null   object
 12  seat_comfort     7120 non-null   float64
 13  cabin_staff      7120 non-null   float64
 14  foodrinks        5878 non-null   float64
 15  ground_staff     7120 non-null   float64
 16  entertainment    3914 non-null   float64
 17  connectivity     1859 non-null   float64
 18  value_for_money  7120 non-null   float64
 19  recommended      7120 non-null   object
dtypes: bool(1), float64(7), int64(2), object(10)
memory usage: 1.1+ MB

In [176]:
df = df.dropna(axis=0, subset=['foodrinks']) ##to complicated to impute

In [177]:
df.shape #we will finally stick to this? ask

(5878, 20)

In [178]:
df['flight_date'] = df['flight_date'].fillna(df['flight_date'].mode()[0])

In [179]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5878 entries, 0 to 7126
Data columns (total 20 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            5878 non-null   int64
 1   airline          5878 non-null   object
 2   total_rate       5878 non-null   int64
 3   review_title     5878 non-null   object
 4   review_date      5878 non-null   object
 5   verified         5878 non-null   bool
 6   review           5878 non-null   object
 7   aircraft         5878 non-null   object
 8   traveller        5878 non-null   object
 9   class_type       5878 non-null   object
 10  route            5878 non-null   object
 11  flight_date      5878 non-null   object
 12  seat_comfort     5878 non-null   float64
 13  cabin_staff      5878 non-null   float64
 14  foodrinks        5878 non-null   float64
 15  ground_staff     5878 non-null   float64
 16  entertainment    3796 non-null   float64
 17  connectivity     1785 non-null   float64
 18  value_for_money  5878 non-null   float64
 19  recommended      5878 non-null   object
dtypes: bool(1), float64(7), int64(2), object(10)
memory usage: 924.2+ KB

In [180]:
df.drop('entertainment', axis=1, inplace=True)
df.drop('connectivity', axis=1, inplace=True)

In [181]:
df.shape

(5878, 18)

In [182]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5878 entries, 0 to 7126
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            5878 non-null   int64
 1   airline          5878 non-null   object
 2   total_rate       5878 non-null   int64
 3   review_title     5878 non-null   object
 4   review_date      5878 non-null   object
 5   verified         5878 non-null   bool
 6   review           5878 non-null   object
 7   aircraft         5878 non-null   object
 8   traveller        5878 non-null   object
 9   class_type       5878 non-null   object
 10  route            5878 non-null   object
 11  flight_date      5878 non-null   object
 12  seat_comfort     5878 non-null   float64
 13  cabin_staff      5878 non-null   float64
 14  foodrinks        5878 non-null   float64
 15  ground_staff     5878 non-null   float64
 16  value_for_money  5878 non-null   float64
 17  recommended      5878 non-null   object
dtypes: bool(1), float64(5), int64(2), object(10)
memory usage: 832.3+ KB

In [183]:
#clean dataset!

Feature Engineering

In [184]:
#create the variables 'origin' and 'destiny' from 'route'. O and D are separated by 'to', so a simple regexp can help.

In [185]:
new = df["route"].str.split(r"\bto\b", expand=True)

In [186]:
new.reset_index(drop=True, inplace=True)

In [187]:
new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5878 entries, 0 to 5877
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       5878 non-null   object
 1   1       5869 non-null   object
 2   2       3 non-null      object
dtypes: object(3)
memory usage: 137.9+ KB

In [188]:
df.reset_index(drop=True, inplace=True)

In [189]:
df.drop(columns='index', inplace=True)

In [190]:
df.sample()

,airline,total_rate,review_title,review_date,verified,review,aircraft,traveller,class_type,route,flight_date,seat_comfort,cabin_staff,foodrinks,ground_staff,value_for_money,recommended
3935,Norwegian,1,"""we absolutely loved it""",23rd January 2020,False,New York to London Gatwick. First time flyer...,Dreamliner,Couple Leisure,Premium Economy,New York to London Gatwick,January 2020,5.0,5.0,5.0,5.0,5.0,yes

In [191]:
#relocate the new variables O and D in the main df

In [192]:
df = pd.concat([df.iloc[:, :10], new, df.iloc[:, 10:]], axis=1)

In [193]:
df.sample()

,airline,total_rate,review_title,review_date,verified,review,aircraft,traveller,class_type,route,0,1,2,flight_date,seat_comfort,cabin_staff,foodrinks,ground_staff,value_for_money,recommended
2479,EVA Air,8,"""the seat was very comfortable""",18th November 2019,True,Shanghai Pudong to Taipei Taoyuan. When I fou...,Boeing 777-300ER,Family Leisure,Economy Class,Shanghai Pudong to Taipei Taoyuan,Shanghai Pudong,Taipei Taoyuan,None,November 2019,5.0,5.0,5.0,4.0,5.0,yes

In [194]:
df.rename(columns={df.columns[10]: 'origin'}, inplace=True)
df.rename(columns={df.columns[11]: 'destiny'}, inplace=True)

In [195]:
df.drop(columns=df.columns[12], inplace=True) #we don't need this variable

In [196]:
df.sample()

,airline,total_rate,review_title,review_date,verified,review,aircraft,traveller,class_type,route,origin,destiny,flight_date,seat_comfort,cabin_staff,foodrinks,ground_staff,value_for_money,recommended
1296,Bamboo Airways,6,"""would prefer a low cost carrier""",21st February 2020,True,Ho Chi Minh to Danang. We did not had to cue...,A320,Family Leisure,Economy Class,Ho Chi Minh to Danang,Ho Chi Minh,Danang,January 2020,4.0,4.0,2.0,1.0,1.0,no

In [197]:
#some flights have in the route also the 'via...'. This means they have scale/s. Let's put this in a different variable

In [198]:
df.destiny.value_counts()

destiny
Bangkok              125
London                95
Singapore             87
Hong Kong             69
Sydney                60
                    ...
Lisbon via Geneve      1
CUC                    1
EOH                    1
Pereira                1
Ndola                  1
Name: count, Length: 2219, dtype: int64

In [199]:
new2 = df["destiny"].str.split(r"\bvia\b", expand=True)

In [200]:
new2.rename(columns={new2.columns[0]: 'destiny2'}, inplace=True)
new2.rename(columns={new2.columns[1]: 'scale'}, inplace=True)

In [201]:
new2.sample() #if scale is 'none' this means no scale was done.

      destiny2     scale
3331   Kigali    Nairobi

In [202]:
#join in to the main df

In [203]:
df = pd.concat([df.iloc[:, :12], new2, df.iloc[:, 12:]], axis=1)

In [204]:
df.drop(columns="destiny", inplace=True)

In [205]:
df.rename(columns={'destiny2':'destiny'}, inplace=True)

In [206]:
df.scale.info() ##many missing. We assume all missings are 'no scale'.

<class 'pandas.core.series.Series'>
RangeIndex: 5878 entries, 0 to 5877
Series name: scale
Non-Null Count  Dtype
--------------  -----
1213 non-null   object
dtypes: object(1)
memory usage: 46.1+ KB

In [207]:
#create a dummy variable of scale (yes/no). By now, don't drop the scale made.

In [208]:
df.insert(13,'scale_yn',np.where(df['scale'].isna(), 0,1))

In [209]:
df.sample()

,airline,total_rate,review_title,review_date,verified,review,aircraft,traveller,class_type,route,...,destiny,scale,scale_yn,flight_date,seat_comfort,cabin_staff,foodrinks,ground_staff,value_for_money,recommended
2234,El Al Israel Airlines,4,"""never been a premium airline""",16th June 2023,True,I have been a loyal customer of El Al for 40 ...,Boeing 737,Couple Leisure,Economy Class,Prague to Tel Aviv,...,Tel Aviv,None,0,May 2023,1.0,4.0,1.0,2.0,3.0,no

In [210]:
df.scale.info()

<class 'pandas.core.series.Series'>
RangeIndex: 5878 entries, 0 to 5877
Series name: scale
Non-Null Count  Dtype
--------------  -----
1213 non-null   object
dtypes: object(1)
memory usage: 46.1+ KB

In [211]:
df.scale_yn.value_counts() #ok

scale_yn
0    4665
1    1213
Name: count, dtype: int64

In [212]:
#hasta aqu√≠ ok

In [213]:
#variable traveller includes type of traveller (solo, family, etc.) and purpose of the travel(leisure, business). Let¬¥s separate both concepts

In [214]:
df.traveller.value_counts()

traveller
Solo Leisure      2196
Couple Leisure    1512
Family Leisure    1092
Business          1078
Name: count, dtype: int64

In [215]:
new3=df["traveller"].str.split(" ", expand=True)

In [216]:
new3.rename(columns={new3.columns[0]: 'traveller_type'}, inplace=True)
new3.rename(columns={new3.columns[1]: 'purpose'}, inplace=True)

In [217]:
new3

     traveller_type  purpose
0              Solo  Leisure
1              Solo  Leisure
2            Couple  Leisure
3              Solo  Leisure
4              Solo  Leisure
...             ...      ...
5873         Couple  Leisure
5874         Couple  Leisure
5875           Solo  Leisure
5876           Solo  Leisure
5877       Business     None

[5878 rows x 2 columns]

In [218]:
df.traveller.info()

<class 'pandas.core.series.Series'>
RangeIndex: 5878 entries, 0 to 5877
Series name: traveller
Non-Null Count  Dtype
--------------  -----
5878 non-null   object
dtypes: object(1)
memory usage: 46.1+ KB

In [219]:
#put 'business' in the purpose variable, not in traveller type

In [220]:
new3["purpose"]=np.where(new3['traveller_type']=="Business", "Bussiness",new3.purpose)

In [221]:
new3.traveller_type.value_counts()

traveller_type
Solo        2196
Couple      1512
Family      1092
Business    1078
Name: count, dtype: int64

In [222]:
new3.purpose.value_counts()

purpose
Leisure      4800
Bussiness    1078
Name: count, dtype: int64

In [223]:
new3["traveller_type"]=np.where(new3['traveller_type']=="Business", "Solo",new3.traveller_type) #assume business is 'solo' in traveller_type

In [224]:
new3.traveller_type.value_counts() #ok

traveller_type
Solo      3274
Couple    1512
Family    1092
Name: count, dtype: int64

In [225]:
df.traveller.value_counts()

traveller
Solo Leisure      2196
Couple Leisure    1512
Family Leisure    1092
Business          1078
Name: count, dtype: int64

In [226]:
df.columns.get_loc('traveller') #this variable is in position 7 in my main df. So the new derived variables must be in position 8,9

7

In [227]:
df = pd.concat([df.iloc[:, :8], new3, df.iloc[:, 8:]], axis=1)

In [228]:
df.sample()

,airline,total_rate,review_title,review_date,verified,review,aircraft,traveller,traveller_type,purpose,...,destiny,scale,scale_yn,flight_date,seat_comfort,cabin_staff,foodrinks,ground_staff,value_for_money,recommended
5277,Thomson Airways,6,"""professional crew""",27th September 2016,False,Puerto Vallarta to London Gatwick with Thomson...,Boeing 787,Couple Leisure,Couple,Leisure,...,LGW,None,0,September 2016,2.0,5.0,4.0,1.0,3.0,yes

In [229]:
df.drop(columns='traveller', inplace=True) #drop original variable

In [230]:
df.info() #ok

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5878 entries, 0 to 5877
Data columns (total 22 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   airline          5878 non-null   object
 1   total_rate       5878 non-null   int64
 2   review_title     5878 non-null   object
 3   review_date      5878 non-null   object
 4   verified         5878 non-null   bool
 5   review           5878 non-null   object
 6   aircraft         5878 non-null   object
 7   traveller_type   5878 non-null   object
 8   purpose          5878 non-null   object
 9   class_type       5878 non-null   object
 10  route            5878 non-null   object
 11  origin           5878 non-null   object
 12  destiny          5869 non-null   object
 13  scale            1213 non-null   object
 14  scale_yn         5878 non-null   int32
 15  flight_date      5878 non-null   object
 16  seat_comfort     5878 non-null   float64
 17  cabin_staff      5878 non-null   float64
 18  foodrinks        5878 non-null   float64
 19  ground_staff     5878 non-null   float64
 20  value_for_money  5878 non-null   float64
 21  recommended      5878 non-null   object
dtypes: bool(1), float64(5), int32(1), int64(1), object(14)
memory usage: 947.3+ KB

In [231]:
df.class_type.value_counts()

class_type
Economy Class      4284
Business Class     1227
Premium Economy     258
First Class         109
Name: count, dtype: int64

Questions

1- reviews over time: prophet
2- classification system: creating an overall rating, recommend which is the best airline
3- classification system: including a country, which is the best airline to use
4- what does affect that an airline is recommended or not (logit)
5- clustering
6- sentiment analysis
7- Tableau: que metiendo un avion me diga reviews, a donde vuela, etc.


- Link seatguru

In [232]:
df["airline"].nunique()

409

In [233]:
(df["airline"]== 'Level').sum()

15